In [1]:
import mariadb as mdb
import json
import pandas as pd
from sqlalchemy import create_engine

In [5]:
engine = create_engine('mysql+pymysql://root:@localhost/testDB')
print(engine.table_names())

['client', 'konosuba', 'partner', 'staff_request', 'timesheet_entry']

In [3]:
pd.set_option('display.max_columns', 100)
pd.set_option('display.max_rows', 300)

dbname = 'testDB'
cfg_path = '../server.cfg'

with open(cfg_path, 'r') as f:
    server_config = json.load(f)
db = mdb.connect(**server_config)
cursor = db.cursor()

In [4]:
command = f'USE {dbname};'
try:
    cursor.execute(command)
except mdb.ProgrammingError:
    print('database does not exist')

In [8]:
command = '''
SHOW COLUMNS FROM konosuba
'''
cursor.execute(command)
cursor.fetchall()

[('id', 'int(11)', 'NO', 'PRI', None, ''),
 ('name', 'varchar(50)', 'YES', '', None, ''),
 ('class', 'varchar(50)', 'YES', '', None, ''),
 ('race', 'varchar(50)', 'YES', '', None, ''),
 ('male', 'tinyint(1)', 'YES', '', None, ''),
 ('age', 'int(11)', 'YES', '', None, '')]

In [6]:
command = '''
SELECT * FROM konosuba
'''
cursor.execute(command)
df = pd.DataFrame(cursor.fetchall())
df

   0         1            2      3  4    5
0  1    Kazuma   adventurer  human  1   17
1  2      Aqua       priest    god  0  999
2  3   Megumin       wizard  human  0   14
3  4  Darkness     crusader  human  0   19
4  5     Chris        thief  human  0   15
5  6    Yunyun       wizard  human  0   14
6  7       Wiz       wizard   lich  0   20
7  8    Kyouya  swordmaster  human  1   20

In [6]:
sql = """
SELECT * FROM konosuba
"""

df = pd.read_sql_query(sql, engine)
df.head()

   id      name       class   race  male  age
0   1    Kazuma  adventurer  human     1   17
1   2      Aqua      priest    god     0  999
2   3   Megumin      wizard  human     0   14
3   4  Darkness    crusader  human     0   19
4   5     Chris       thief  human     0   15